app/controllers/activations_controller.rb

    def new
      @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)
---
SELECT * FROM "users" WHERE (perishable_token = 'Hy3LlakZz1UoeQvtNNl' and updated_at > '2010-10-02 22:42:38') LIMIT 1

    def create
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE (users.cached_slug = '20') LIMIT 1