app/controllers/educations_controller.rb

SELECT * FROM "institutes" WHERE ("institutes"."level" = 'secondary')
---
  def institute_type_education
    @institutes = Institute.find_all_by_level(params[:type])