app/controllers/studies_controller.rb

  def index
    @studies = Study.all
---
SELECT * FROM "studies" WHERE ( ("studies"."type" = 'Secondary' ) )