app/controllers/users_controller.rb

INSERT INTO "users" ("address", "single_access_token", "created_at", "photo_file_size", "crypted_password", "perishable_token", "updated_at", "photo_file_name", "admin", "country_id", "photo_content_type", "gender", "password_salt", "photo_updated_at", "last_name", "persistence_token", "phone", "birthday", "company_id", "cached_slug", "login", "dni", "state_id", "marital_status", "first_name", "email", "active", "mobile_phone") VALUES(NULL, 'OyfZ4lkcn30HCtxLB4Q', '2010-11-13 20:02:02', NULL, 'f8c9a952510ecb4466b6073675ee35b335d7c19d644c99db58b3590eb27a477b05512afc749a1030cac03078567cce902c109c74b3316f410dff75e930ca004f', 'nVxbe221qYkK1UmvvizG', '2010-11-13 20:02:02', NULL, 'f', NULL, NULL, NULL, 'aLRgLfI5zqoURQxGfZ7', NULL, 'last name', '569afdb16e4b267be5c3421e0748865209ebad3db85372cda016a8e47e17fef48641c1818ffe9735f7c407f9ad6fd0abc6ae0aa81b622f3a2baeb8501586124e', NULL, NULL, 1, NULL, 'login', NULL, NULL, NULL, 'first name', 'login@login.com', 'f', NULL)
---
  def create
    create!(:notice => "User was successfully created. Check your email" ) do |success|
      success.html do
        UserSession.create(@user)