app/controllers/user_sessions_controller.rb

SELECT * FROM "companies" WHERE ("companies"."login" = 'company login') LIMIT 1
---
  def create
    if @company = Company.find_by_login(params[:user_session][:company_login])